Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/result1/Iteration1/t7_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/association/contracts/2010/05/IAssociationService/RemoveAssociation</wsa:Action><wsa:MessageID>uuid:e408eace-ddba-43c0-bd27-37876a0e2d1f</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslassociationserviceqa1.testgs.pvt/AssociationService.svc</wsa:To></soap:Header><soap:Body><RemoveAssociation xmlns="http://www.gamestop.com/services/csl/association/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AssociationHandle xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">abcde</AssociationHandle><DistinguishingFactor xmlns="http://www.gamestop.com/services/csl/association/messages/2010/05">abcde</DistinguishingFactor></request></RemoveAssociation></soap:Body></soap:Envelope>